app/views/mypage/pages/student.html.erb

SELECT  `profiles`.* FROM `profiles` WHERE `profiles`.`deleted_at` IS NULL AND `profiles`.`user_id` = 1 LIMIT 1
---
        <% end %>
        <% if Profile.find_by(user_id: current_user.id).image.blank? %>

SELECT  1 AS one FROM `reports` WHERE `reports`.`user_id` = 1 LIMIT 1
---
        <% end %>
        <% if Report.where(user_id: current_user.id).empty? %>