class StringUtil
  def self.convert_ja_small_to_large(str)
    hash = {
      'ぁ' => 'あ',
      'ぃ' => 'い',
      'ぅ' => 'う',
      'ぇ' => 'え',
      'ぉ' => 'お',
      'っ' => 'つ',
      'ゃ' => 'や',
      'ゅ' => 'ゆ',
      'ょ' => 'よ',
      'ゎ' => 'わ',
      'ァ' => 'ア',
      'ィ' => 'イ',
      'ゥ' => 'ウ',
      'ェ' => 'エ',
      'ォ' => 'オ',
      'ヵ' => 'カ',
      'ヶ' => 'ケ',
      'ッ' => 'ツ',
      'ャ' => 'ヤ',
      'ュ' => 'ユ',
      'ョ' => 'ヨ',
      'ヮ' => 'ワ'
    }

    str.gsub(/#{hash.keys.join('|')}/, hash)
  end
end