app/views/delivery_stops/show.html.erb

SELECT  `students`.* FROM `students` WHERE `students`.`user_id` = 1 LIMIT 1
---
          </small>
          <% if current_user.student.present? || current_user.company.present? %>