app/controllers/mypage/pages_controller.rb

SELECT  `students`.* FROM `students` WHERE `students`.`user_id` = 1 LIMIT 1
---
  def student
    @student = current_user.student
    return redirect_to mypage_root_path unless @student
    @headlines = Headline.all.order(created_at: :desc).limit(3)
    @reports = Report.where(user_id: current_user.id)
                 .order(created_at: :desc).limit(5)
    @offers = Offer.where('student_id = ? AND status = ? AND closing_date >= ?',
      current_user.student.id, Offer::S_NEW, Time.zone.now.midnight)