app/controllers/mypage/students_controller.rb

SELECT  `student_change_notifications`.* FROM `student_change_notifications` WHERE `student_change_notifications`.`student_id` = 1 ORDER BY `student_change_notifications`.`id` DESC LIMIT 1
---
  def details
    @change_notification = @student.change_notifications.last