app/controllers/pages_controller.rb

SELECT  `projects`.* FROM `projects` WHERE `projects`.`status` IN (4, 5, 6) AND NOT (end_at < '2020-10-18 02:00:23.943248') ORDER BY `projects`.`created_at` DESC LIMIT 4
SELECT  `events`.* FROM `events` WHERE `events`.`status` IN (4, 6) AND NOT (end < '2020-10-18 02:00:23.960453') ORDER BY `events`.`created_at` DESC LIMIT 4
SELECT `sliders`.* FROM `sliders` ORDER BY `sliders`.`rank` ASC
SELECT  `sites`.* FROM `sites` WHERE `sites`.`id` = 1 LIMIT 1
---
  def index
    @headlines = Headline.all.active.limit(5)
    @pickup_projects = Project.includes(:company)
                      .where(status: [Project::S_ACTIVE, Project::S_REJECTED, Project::S_FINISH])
                      .where.not('end_at < ?', Time.now)
                      .order(created_at: :desc).limit(4)
    @pickup_events = Event.includes(:company)
                        .where(status: [Event::E_OPEN, Event::E_END])
                        .where.not('end < ?', Time.now)
                        .order(created_at: :desc).limit(4)
    @executed_projects = ExecutedProject.includes(project: [:company, :categories, :products]).all.order(:rank).limit(8)
    sliders = Slider.includes(:headline, project: [:company]).all.order(:rank)

    @pickup_students = Student.all.order(created_at: :desc).limit(16) if user_signed_in? && current_user.has_role?(:company)

    project_ids = []

    sliders.each do |s|
      if !s.project_id.nil? &&  !s.project.can_display?
        project_ids.push(s.project_id)
      end
    end

    if project_ids.length > 0
      @sliders = sliders.where.not(project_id: [project_ids]) + sliders.where.not(slider_type: 'Project')
    else
      @sliders = sliders
    end

    unless user_signed_in?
      @site = Site.find(1)