app/controllers/mypage/students/wizard/agreements_controller.rb

SELECT  `student_agreements`.* FROM `student_agreements` WHERE `student_agreements`.`deleted_at` IS NULL AND `student_agreements`.`user_id` = 1 LIMIT 1
SELECT  `students`.* FROM `students` WHERE `students`.`user_id` = 1 LIMIT 1
---
  def show
    @agreement = current_user.student_agreement.present? ? current_user.student_agreement : StudentAgreement.new

INSERT INTO `student_agreements` (`user_id`, `pdf1`, `pdf2`, `agreement`, `created_at`, `updated_at`) VALUES (1, TRUE, TRUE, TRUE, '2020-10-20 06:01:17', '2020-10-20 06:01:17')
---
  def create
    @agreement = StudentAgreement.new(student_agreement_params)
    @agreement.user_id = current_user.id

    if @agreement.save