app/controllers/mypage/students/wizard/students_controller.rb

SELECT  `students`.* FROM `students` WHERE `students`.`user_id` = 1 LIMIT 1
---
  def show
    @student = current_user.student.present? ? current_user.student : Student.new

SELECT  `students`.* FROM `students` WHERE `students`.`user_id` = 1 LIMIT 1
INSERT INTO `students` (`user_id`, `first_name`, `first_name_kana`, `last_name`, `last_name_kana`, `nickname`, `gender`, `birth_on`, `zip_code`, `prefecture_id`, `city`, `address1`, `address2`, `phone`, `phone_mobile`, `bunri`, `university`, `university_name`, `depart`, `labo`, `industry_1`, `occupation_1`, `industry_2`, `occupation_2`, `industry_3`, `occupation_3`, `intern_is`, `intern_company`, `intern_detail`, `graduation_year`, `graduation_month`, `toeic_score`, `qualifications`, `mypr`, `circle`, `jobhuntingaxis_text`, `jobhuntingaxis`, `club`, `created_at`, `updated_at`) VALUES (1, 'ss', 'アア', 'ss', 'アア', 'aaa', 0, '1997-10-20', '100-0000', 13, '千代田区', '1-1-1', '', '', '090-0000-0000', FALSE, 21, '', 'ddd', 'ss', 2, 6, 3, 7, 11, 13, FALSE, '', '', 2021, 3, 0, '', '', 'ss', '', 1, '', '2020-10-20 06:02:42', '2020-10-20 06:02:42')
---
  def create
    if current_user.student.present?
      @student = current_user.student
      @student.assign_attributes(student_params)
    else
      @student = Student.new(student_params)
      @student.user_id = current_user.id
    end

    @profile = current_user.profile
    @agreement = current_user.student_agreement
    #@interview = current_user.student_interview

    begin
      ActiveRecord::Base.transaction do
        @student.save!(context: :registration)