app/controllers/users/registrations_controller.rb

INSERT INTO `users` (`email`, `encrypted_password`, `confirmation_token`, `confirmation_sent_at`, `created_at`, `updated_at`) VALUES ('kami5330.key@gmail.com', '$2a$10$4aj7Ki9MqxkWMb3UBe1pWueoZiZE7gYYtGYcvNnITgJI65ThTv0iC', 'Pafs_Z3mtvwRxRw4Vhjg', '2020-10-18 01:59:25', '2020-10-18 01:59:25', '2020-10-18 01:59:25')
---
      if connection
        connection.delete('email') if connection.key?('email')
        connection['user_id'] = resource.id
        UserConnection.create!(connection) # TODO: catch