app/controllers/users/sessions_controller.rb

SELECT  `students`.* FROM `students` WHERE `students`.`user_id` = 1 LIMIT 1
---
  def create
    self.resource = warden.authenticate!(auth_options)

    if resource.student.present? && !resource.student.can_sign_in?

SELECT  `user_tokens`.* FROM `user_tokens` WHERE `user_tokens`.`device_token` IS NULL LIMIT 1
---
  def destroy
    user_token = UserToken.find_by(device_token: cookies.signed[:device_token])